app/controllers/local_devise/registrations_controller.rb

INSERT INTO `users` (`confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `image_url`, `last_sign_in_at`, `last_sign_in_ip`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role`, `sign_in_count`, `thanxup_id`, `uid`, `unconfirmed_email`, `updated_at`, `username`) VALUES ('2013-08-16 16:58:03', 'Kz5QnWPBrVuqJHpGn8Nf', NULL, '2013-08-16 16:58:03', NULL, NULL, 'jorgemoscat@gmail.com', '$2a$10$OYqbotdWFos8eTm8I1cH6uoiqjhpadBMTW5xd1BMzLRbOcLo10BHq', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'user', 0, '', NULL, NULL, '2013-08-16 16:58:03', 'jorgemoscat')
---
  def create
    build_resource(sign_up_params)
    resource.role = User.user_role

    if resource.save