app/controllers/admin_controller.rb

  def index
    @users = User.all.sort(role: 1,username:1)
---
SELECT `users`.* FROM `users` ORDER BY role,username

  def add_new_user
    if (params[:user] and params[:user][:venue])
      pwd = SecureRandom.hex(4) # user will need to use the "forgot password" feature to set a useful password
      options = {:username => params[:user][:username], :email => params[:user][:email], :password => pwd, :password_confirmation => pwd, :role => User.user_role} if params[:user]
      user = User.new(options)
      user.thanx = pwd
      user.venues.push(Venue.new(venue_thnx_id: params[:user][:venue][:venue_thnx_id]))
      unless (user.save)
        @error_message = user.errors.full_messages.map{|s| s}.join('<br />') if user.errors
---
INSERT INTO `users` (`confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `image_url`, `last_sign_in_at`, `last_sign_in_ip`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role`, `sign_in_count`, `thanxup_id`, `uid`, `unconfirmed_email`, `updated_at`, `username`) VALUES ('2013-08-16 17:00:18', 'irS6nanDqLQkySxv2rRN', NULL, '2013-08-16 17:00:18', NULL, NULL, 'jorge@thanxup.com', '$2a$10$Ue3SBzmpaZsbFN1Xk2/2rOisPw9umu0XXGqUmF4mUrfR9pP4q3EuS', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'user', 0, '', NULL, NULL, '2013-08-16 17:00:18', 'jorgepardos')
INSERT INTO `venues` (`created_at`, `updated_at`, `user_id`, `venue_thnx_id`) VALUES ('2013-08-28 11:03:56', '2013-08-28 11:03:56', 3, '121231')
SELECT `users`.* FROM `users` ORDER BY role,username

  def delete_user
    @user = User.find(params[:id])
    @user.destroy if current_user.is_admin?
    @users = User.all.sort(role: 1,username:1)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3
SELECT `users`.* FROM `users` ORDER BY role,username